<template>
  <div class="wrapper">
    <div class="item" v-for="item in list" :key="item.date">
      <div>{{ item.date }}</div>
      <div v-html="item.msg"></div>
    </div>
  </div>
</template>

<script setup>
let list = [
  {
    date: "2023年11月26号",
    msg: `和小鱼看的第一场电影，黄渤周迅演的《涉过愤怒的海》，在李村和谐广场。看完电影回家路上聊了会儿，约好下次请她吃饭。`,
  },
  {
    date: "2023年12月1号",
    msg: `和小鱼一起吃午饭，她打车从城阳来我这边，苗岭路。吃的东镇火锅，聊得很开心。她走了后想她。`,
  },
  {
    date: "2023年12月2号",
    msg: `我去黄岛吃饭，她在黄岛看李上安live，想见她，非常疯狂的一晚。`,
  },
  {
    date: "2023年12月3号",
    msg: `她把小兔子送我了。我们去台东看脱口秀，她第一次看，笑的很开心，但我才是全场最开心的那一个。`,
  },
  {
    date: "2023年12月5号",
    msg: `我们知道了彼此的名字，她说这是正式认识。`,
  },
  {
    date: "2023年12月9号",
    msg: `我回栖霞参加婚礼，临走有点发烧，她随后坐高铁去栖霞要帮我开车，感动不已。傍晚偷跑出去见她，想她。`,
  },
  {
    date: "2023年12月10号",
    msg: `回青路上小鱼开车，事后坦白这是第一次跑高速，很稳，我路上睡得很香。晚上一起去跨海大桥那走了会儿，旁边就是列车轨道，我要当面对她表白：我要跟你在一起。`,
  },
  {
    date: "2023年12月15号",
    msg: `第一次去她家，晚上下了点小雪，第一次和她喝酒，干红，聊了好多，说不尽的相思，互诉衷肠。彼此交了个底，经济上的。`,
  },
  {
    date: "2023年12月17号",
    msg: `我们去跨海大桥看了日落，超级美。第一次带她去吃楼下的羊汤，她很喜欢。吃完去崂山冰山之角看红楼梦主题的音乐会，路上她对她弟弟出柜了，感动。`,
  },
  {
    date: "2023年12月22号",
    msg: `冬至，在她家我们一起包饺子，韭菜肉的，非常好吃，又喝了点酒，第二次喝，干白，报喝。`,
  },
  {
    date: "2023年12月24号",
    msg: `我们一起看的第二场电影，《三大队》，看完吃的吕氏疙瘩汤，肉末粉条挺好吃。下午回家又看了个电影。早中晚一天做了好多次，我身体累了。`,
  },
  {
    date: "2023年12月30号",
    msg: `我们去上海，是她毕业后待了两年的城市。蟹黄面和汤包贼好吃。`,
  },
  {
    date: "2023年12月31号",
    msg: `她选的上海菜很好吃。一起在外滩跨年，很喜欢小鱼。`,
  },
  {
    date: "2024年1月2号",
    msg: `我说错了话，晚上睡觉她哭了，我心如刀割，不想让她伤心难过，要好好珍惜她。`,
  },
  {
    date: "2024年1月3号",
    msg: `她32周岁生日，想当甩手掌柜，我来安排。给她送了鲜花，她说是第一次收到花。吃的波漯油子，我们第三次喝酒，她第一次喝白酒，陪我。`,
  },
  {
    date: "2024年1月5号",
    msg: `周五，小鱼回高密了，最早周天晚上见面，是在一起之后分开最久的一次，想她。`,
  },
  {
    date: "2024年1月7号",
    msg: `周天，在球馆看到提前回青的小鱼，想给我个惊吓，但被我发现了，哈哈，开心。看她打球时，眼里只有她。<br>晚上我们去吃了我超级喜欢的鲈鱼，她讲了她在银川，以及后面打官司时发生的一些事，倔强的小鱼，摸摸头，希望她事事顺心。`,
  },
  {
    date: "2024年1月11号",
    msg: `晚上的飞机去哈尔滨，一起去的第二个地方，开心！`,
  },
  {
    date: "2024年1月12号",
    msg: `下午去了冰雪大世界，超级壮观、震撼，真是打造了一座冰雪世界。哈尔滨好冷，不适合我。<br>格瓦斯小鱼很喜欢喝。<br>晚上喝了点白酒，小鱼说牛栏山不辣，第四次喝酒。`,
  },
  {
    date: "2024年1月13号",
    msg: `去了松花江，哈尔滨好冷，浑身贴满暖宝宝。小鱼走出汗了⊙ω⊙晚上冻感冒了。<br>第五次喝酒，牛栏山，小鱼酒量日渐增长。<br>晚上我为她准备了礼物——穿着情趣内衣的我自己，她非常喜欢。喜欢小鱼，喜欢和小鱼做。`,
  },
  {
    date: "2024年1月14号",
    msg: `晚上打电话到很晚，怀疑我俩的相处模式。我是个胆小鬼，这些年的惯性让我习惯一个人，时不时会想要逃离，放松放松放松！`,
  },
  {
    date: "2024年1月15号",
    msg: `小鱼消化不太好，开始喝益生菌了，但愿会有效果，希望她好。`,
  },
  {
    date: "2024年1月20号",
    msg: `我拔智齿，殊不知，万恶的起源……<br>晚上一起去看了小王子话剧，很好看，喜欢小王子，喜欢狐狸，和小鱼一起做什么都好。<br>她感冒了，回家后，没忍住（怪我“循循善诱”），睡一起了。`,
  },
  {
    date: "2024年1月25号",
    msg: `拔智齿后第五天，一直发炎，非常疼痛，小鱼陪我去医院，跑前跑后很辛苦。脸一侧肿了，她说我是松鼠牛牛。去了石老人，天气特别好，把她的名字写在沙滩上，喜欢小鱼。晚上带我去喝鸡汤，很好喝，快点好起来⊙∀⊙！<br>担心自己噶掉，写了封遗书，笑鼠。`,
  },
  {
    date: "2024年1月26号",
    msg: `起床后不太舒服，去了医院，去查血的时候身体愈发虚弱，没绷住哭了，给小鱼打电话，她很着急，急匆匆赶来。相见的那一刻我知道，有人比我自己还希望我好，喜欢小鱼。`,
  },
  {
    date: "2024年1月27号",
    msg: `我们去赶了李村大集，买了很多东西，拉着她的小推车。回来路上小推车轱辘掉了，她固执地说要修好继续用的样子很可爱。<br>中午她做的海鲜，我张不开嘴没有口福喽~晚上她炖的鸽子汤给我喝，很好喝，小鱼炒菜很好吃，喜欢小鱼。<br>下午我去输液了，吃药管不住了，身体很弱，小鱼陪我，小鱼真好。<br>晚上睡觉我们分被睡（第一天实行），我俩睡觉都太轻了，效果不错，她去洗手间我都不知道，一觉到天亮！`,
  },
  {
    date: "2024年1月28号",
    msg: `小鱼吃益生菌有成效，最近噗噗放屁，哈哈把她整郁闷了，我很开心，希望她好。<br>傍晚去白泥地公园看了日落，时间刚刚好，日落超级美。<br>小鱼做饭真好吃，味道很好，做饭速度还贼快，喜欢小鱼。`,
  },
  {
    date: "2024年1月29号",
    msg: `周一，我们腻歪了三天，小鱼一直照顾我，今天各自上班，超级想她。<br>晚上下班，小鱼已经做好饭等我了，家的感觉，喜欢，要对小鱼好。`,
  },
  {
    date: "2024年1月30号",
    msg: `小鱼想吃糖葫芦（因为她做梦梦见生孩子，有点恶心，想吃点酸的），我去李村买了糖葫芦和一朵很好看的玫瑰花。到家了把花送到她面前，她很惊喜，她开心我就开心。<br>晚上做了蘑菇炒肉，小鱼做饭真好吃，喜欢小鱼。<br>晚上我在泡脚，一边看书，她趴在床上看手机，我手机震动，拿起一看，是她发的短信：这样的生活真是惬意。`,
  },
  {
    date: "2024年1月31号",
    msg: `小鱼洗完澡对着镜子一通翻头发，她在找白头发，前一阵发现了一根她要崩溃了，我在心里默默想：我会陪着你的，用我自己的方式。<br>睡前我们亲了无数遍，湿的一塌糊涂，我姨妈未结束，小鱼说不可以，我知道她说一不二，亲了一会儿发现都半夜了，赶紧入睡！`,
  },
  {
    date: "2024年2月1号",
    msg: `昨晚没休息好，整个人脑子都是宕机状态，为了身体考虑，早上我提议先分开睡，她抱着我的手瞬间耷拉了~<br>晚上小鱼睡在气垫床上，睡在地上，哈哈又辛酸又倔强，喜欢。`,
  },
  {
    date: "2024年2月2号",
    msg: `今日小年，早上跟小鱼讲可能要去别的项目组了，她悄没声地订了个蛋糕送过来，让我分给同事们一起吃，小鱼心细，喜欢小鱼。<br>我晚上团建完，正好碰上小鱼她们打完球来吃饭，时间刚刚好。第一次线下les聚会，很有趣，都是有趣的人，喜欢小鱼。<br>晚上做到很晚，垫子床单湿了好多好多，喜欢和小鱼做。`,
  },
  {
    date: "2024年2月3号",
    msg: `换了个枕头，戴着耳塞，睡得还不错~与小鱼慢慢摸索相处方式，喜欢小鱼。`,
  },
];
</script>

<style scoped>
.wrapper {
  padding: 40px 20px 20px 20px;
}
.item {
  margin-bottom: 20px;
}
@media (min-width: 768px) {
  .wrapper {
    max-width: 768px;
    margin: 0 auto;
  }
}
</style>
